tom38121605/RD_01_protocol_spi/示例_my/_02_06_spi被动方式示例_my_nrf_52832_ok/nRF5_SDK_11.0.0_spis_03_mod2_add_buf2_ok/examples/peripheral/spis/main.c
/* Copyright (c) 2015 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

#include "nrf_drv_spis.h"
#include "nrf_log.h"
#include "nrf_gpio.h"
#include "boards.h"
#include "app_error.h"
#include <string.h>

#if defined(BOARD_PCA10036) || defined(BOARD_PCA10040)
#define SPIS_CS_PIN  29 /**< SPIS CS Pin. Should be shortened with @ref SPI_CS_PIN */
#elif defined(BOARD_PCA10028)
#define SPIS_CS_PIN  4 /**< SPIS CS Pin. Should be shortened with @ref SPI_CS_PIN */
#else

#error "Example is not supported on that board."
#endif

#define SPIS_INSTANCE 1 /**< SPIS instance index. */
static const nrf_drv_spis_t spis = NRF_DRV_SPIS_INSTANCE(SPIS_INSTANCE);/**< SPIS instance. */

////#define TEST_STRING "Nordic"
//#define TEST_STRING "abcdef"
//static uint8_t       m_tx_buf[] = TEST_STRING;           /**< TX buffer. */
//static uint8_t       m_rx_buf[sizeof(TEST_STRING)+1];    /**< RX buffer. */
//static const uint8_t m_length = sizeof(m_tx_buf);        /**< Transfer length. 


#define TEST_STRING "abcdeabcde1234567890abcdeabcde1234567890abcdeabcde1234567890"

#define TXBUFLEN  60 

static uint8_t       m_tx_buf[TXBUFLEN] = TEST_STRING;            
static uint8_t       m_rx_buf[TXBUFLEN+1];     
static uint8_t       m_rx_buf2[TXBUFLEN+1];     
static const uint8_t m_length = sizeof(m_tx_buf); 


static volatile bool spis_xfer_done; /**< Flag used to indicate that SPIS instance completed the transfer. */

/**
 * @brief SPIS user event handler.
 *
 * @param event
 */
void spis_event_handler(nrf_drv_spis_event_t event)
{
    if (event.evt_type == NRF_DRV_SPIS_XFER_DONE)
    {
        spis_xfer_done = true;
        //NRF_LOG_PRINTF(" Transfer completed. Received: %s\n",m_rx_buf);
    }
}
 
int main(void)
{

    NRF_LOG_INIT();
    NRF_LOG_PRINTF("SPIS example\n");

    nrf_drv_spis_config_t spis_config = NRF_DRV_SPIS_DEFAULT_CONFIG(SPIS_INSTANCE);
   
    spis_config.csn_pin               = 12;
    spis_config.sck_pin               = 13;
    spis_config.miso_pin              = 15;
    spis_config.mosi_pin              = 14;   
    
    nrf_drv_spis_init(&spis, &spis_config, spis_event_handler);
   
   spis_xfer_done = false;
    
   memset(m_rx_buf, 0, m_length);
   nrf_drv_spis_buffers_set(&spis, m_tx_buf, m_length, m_rx_buf, m_length);    
   
 

    while(1)
    {

       
      if (spis_xfer_done==true)
      {         
         spis_xfer_done = false;         

         NRF_LOG_PRINTF(" Transfer completed. Received: %s\n",m_rx_buf);
         
         memcpy(m_rx_buf2,m_rx_buf,sizeof(m_rx_buf));           

         memset(m_rx_buf, 0, m_length);
         nrf_drv_spis_buffers_set(&spis, m_tx_buf, m_length, m_rx_buf, m_length);          
      }   
       


    }
    
}
 

